# Вводится дата в формате dd.mm.yyy.
# Вывести дату в формате mm\dd\yyyy.

a=str(input('введите дату в формате dd.mm.yyy:'))
list=a.replace('.',' \ ')
print(list)


